package com.lesson1.hw;

/*
            —оздайте класс Easy.
            ѕоместите код, приведенный ниже, в метод main.
            »справьте ошибки в коде.

             од:
 */

public class Easy {
    public static void main(String[] args) {
        int x = 20;  // должно быть объ€вление переменной икс = 20
        x += 50; // должно быть увеличить икс на 50


        int u = 100;    // должно быть объ€вление переменной u = 100
        int m = u * 2; // должно быть объ€вление переменной m в два раза больше u

        int k = (1 % 5) * 1000; // исправьте, чтобы результат не обнул€лс€.

    }
}
